[
  {
    "title": "Truyện Kiều (The Tale of Kieu)",
    "author": "Nguyễn Du",
    "spineColor": "#000000",
    "titleColor": "#f73808",
    "authorColor": "#f73808",
    "rating": 5,
    "genre": "Literature, Poetry, Vietnamese, Epic",
    "datesRead": "March 2024",
    "review": "I bought this book when I got back from Vietnam. I had such a great time and wanted to learn more about the country, and saw this was considered the seminal work of Vietnamese literature. Given that information, I was surprised to find out The Tale of Kieu is an adaptation of the Chinese Jin Yun Qiao. There is clearly an imprint left from millennia of direct and indirect Chinese influence, especially in the north, but I didn't expect *the* Vietnamese epic to be a Chinese story. Further research showed that the act of taking a Chinese work, reforming it to reflect Vietnamese culture and ideas, and going 'see? we made it better' is, in fact, a strong embodiment of the Vietnamese spirit.\n\nWhile reading, I was also surprised by how harrowing and merciless the world is to Kieu. Some struggle is necessary for a good epic, but this was relentless. And again, the idea that this represents the Vietnamese spirit was unexpected to me. It took until the end to see that the story is not one of suffering, but one of resilience, hard-won dignity and stubborn persistence - and looking at Vietnamese history (even including the 200 years since the poem was written), you can easily see why those traits are highly valued. Growing up in a western country, the idea that one should accept and endure hardships in hope fate will eventually smile on them is not something I live by. I immediately want to fight any problem I have head on. It is clear that for people in many parts of the world and history, that is not an option. The only path is to endure it, make sacrifices, and persevere. While that contradicts my personal philosophies, I do find it beautiful in a melancholic way.\n\nThe most impressive aspect of the poem, for me, was how Du captures the tension and conflict between Buddhism, Confucianism and the human condition. Kieu's sacrifice for her father embodies Confucianism - by honouring her duty to her family and hierarchy, she is doing 'the right thing' but subjugating herself to a life of suffering in the process. Her acceptance of her brutal fate is a Buddhist tenet, and Buddhist themes of suffering, karma and cycles are woven throughout the poem, but there are also elements of defiance and depth that lead the reader to question if it is just for a virtuous and talented women to accept a life of suffering because it is what heaven wills. \n\nKieu's love, rage and dreams embody her humanity. Her romantic passion competes with her Confucian filial piety, her refusal to resign herself completely to suffering questions Buddhist detachment. In hindsight, it is absolutely astounding how Du was able to weave these themes throughout the narrative in such a natural, authentic manner. I like that this doesn't come across as a critique or judgement of any of those ways are thinking, but rather explores the complicated nature of navigating life and hardship with all those factors in mind. With Kieu ultimately being rewarded for her sacrifices and endurance of suffering, I read the novel as an affirmation of these philosophies and an ode to Vietnamese values and beliefs. I absolutely now see why this poem is so important to Vietnamese heritage and culture.\n\nIt's a shame I don't speak Vietnamese - I'm sure this would have been even better in the original lục bát structure."
  },
  {
    "title": "The Sailor Who Fell From Grace with the Sea",
    "author": "Yukio Mishima",
    "spineColor": "#ca0b0b",
    "titleColor": "#ffffff",
    "authorColor": "#ffffff",
    "rating": 5,
    "genre": "Fiction, Literature, Japanese, Asian",
    "datesRead": "february 2025",
    "review": "An interesting and well-crafted novel, though its meaning isn’t immediately clear - at least in English.\r\n\r\n With no prior knowledge of Mishima, the book might read as a nebulous warning against dispassion, youthful arrogance, the pursuit of glory, and rebellion against domestication. Understanding Mishima’s life and how he speaks through his characters - particularly Noboru - reveals something more disconcerting. Rather than condemning these ideas, he endorses them, presenting their 'consequences' not as tragedy but as fate asserting itself as it should.\r\n\r\n I kept waiting for Noboru to be met with some grand consequence for being coerced by The Chief into cruelty and hubris. It was only with 10 pages left - on the edge of my seat, waiting for the twist - that I realised there would be no repercussions. In Mishima's worldview, the mundanity and inertia of post-war Japan is evil, while violence, rejection of conventional morality and self-sacrifice in the name of glory are truly heroic.\r\n\r\nFor me, this made the novel more compelling. Mishima's ability to articulate ideas that are widely unpalatable to modern society with such artistry and conviction is rare and exhilarating - but it certainly isn’t for the faint-hearted.\r\n\r\nA side note: one of the most striking cultural contrasts when visiting Japan is how frequently people offer polite apologies for even minor inconveniences. In The Sailor, not a single character apologises. This is no accident - Mishima clearly saw modern social norms, particularly the expectation to suppress oneself for the comfort of others, as contemptible."
  }
]