[
  {
    "title": "Unmanned Aerial Systems Researcher",
    "organization": "School of AMME, University of Sydney",
    "dates": "Sep 2024 – Dec 2024",
    "links": [
      {"type": "research", "url": "research.html#uav-deterrence-paper", "text": "Research"},
      {"type": "project", "url": "projects.html#uav-deterrence", "text": "Project"}
    ],
    "description": "- Developed a novel magnetodynamic framework for UAV-based bird deterrence, achieving ~91% effectiveness with a biomimetic \"wolf-pack\" algorithm (vs ~65% with traditional pursuit methods).\n- Designed and implemented a simulation environment integrating physics-based flock modeling, multiple herding algorithms, and real-time state estimation; validated with trials using 10 Tello EDU drones.\n- Created a high-performance C++ swarm control and calibration toolkit for distributed aerial systems, addressing limitations in existing Python-based solutions. Preparing findings for publication in a robotics journal."
  },
  {
    "title": "Mechatronics Intern",
    "organization": "Rio Tinto Centre for Mining Automation",
    "dates": "Feb 2024 – Aug 2024",
    "links": [
      {"type": "research", "url": "research.html#mine-sampling-paper", "text": "Research"},
      {"type": "project", "url": "projects.html#mine-sampling", "text": "Project"}
    ],
    "description": "- Developed an adaptive sampling method that demonstrated a theoretical 40% cost reduction for data collection (versus industry-standard techniques) on a mine site, while maintaining or reducing model uncertainty.\n- Applied advanced probabilistic modeling (Gaussian Processes, Random Forests) to mine geology data, achieving 80%+ accuracy in ore grade prediction with quantified uncertainty estimates.\n- Designed and validated intelligent sample placement algorithms that yielded a 50% improvement in information gained per sample compared to uniform sampling; co-authored a publication (pending patent approval)."
  },
  {
    "title": "Summer Research Scholar",
    "organization": "Australian Centre for Field Robotics",
    "dates": "Dec 2022 – Feb 2023",
    "links": [
      {"type": "research", "url": "research.html#acfr-paper", "text": "Research"}
    ],
    "description": "- Researched change detection and mapping techniques, investigating state-of-the-art machine learning methods and presenting findings to academic and industry audiences.\n- Trained a neural network for underwater change detection, overcoming challenges from variable water conditions, lighting, and lack of rigid structures."
  },
  {
    "title": "Research Assistant",
    "organization": "School of Physics, University of Sydney",
    "dates": "Aug 2020 – Dec 2023",
    "links": [],
    "description": "- Worked on projects with the Photonics & Fibre Optics group (ARC Centre of Excellence in Exciton Science) and the Solar Energy Research Group, tackling cutting-edge problems in photonics and materials science.\n- Led a special research project on energy harvesting in fibers and wearable technology, determining that current piezoelectric, thermoelectric, and triboluminescent methods in nanofibers cannot power low-energy devices given present fabrication techniques.\n- Investigated the use of Metal-Organic Framework glass to stabilize perovskite solar cells, demonstrating strong electrical performance and improved stability against environmental stressors (air, moisture, sunlight)."
  }
]